'''Считайте со стандартного ввода символ и выведите его код.

Входные данные
Программа получает на вход один символ с кодом от 33 до 126.

Выходные данные
Нужно вывести одно число - код считанного символа'''
a=input()
n=len(a)
print(ord(a))