#Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
print((179*179+971*971)**0.5)
